{
  "location": "intro",
  "script": [
    { "action": "music", "name": "intro" },
    "Newfall is the perfect town, but if you think you can have any of it, you're an idiot.",
    "Not the girls with sun-kissed legs, rollerblading down the streets.",
    "Not the million-dollar yachts, bobbing lazily in the bright-blue harbor.",
    "Not the cheerful laughter of the families, picnicking in the park.",
    "None of it will ever be yours.",
    "And who's to blame? Society and shitty genetics?",
    "To have winners, you need losers. And in life's zero-sum game... sorry, kid — snake eyes.",
    "...",
    "The days all bleed together in a diarrhea of misery and self-loathing.",
    "Every morning, you sleep in like a bum. Get yelled at for being a disappointment.",
    "You work a pointless job, earning a few pointless bucks that you spend on pointless pizzas that taste like pepperoni and ballsack.",
    "Every night, you eat alone, trying not to cry.",
    "And then you cry. What else is there?",
    { "action": "sound", "name": "train_passing", "trans": "fadeIn", "amount": 3.0 },
    "Train-smashed tomato sauce is the only way out... but not if you're a pussy.",
    "...",
    "Growing up, you expect life to be a fairytale.",
    "You'll make it through school, get a good job, meet the girl of your dreams.",
    "That's what you tell yourself as you stuff your promposal into the garbage because you're too much of a wimp to ask.",
    "There's more fish in the sea. More opportunities.",
    "That's what goes through your head as you stay home and play video games instead of going to that party...",
    "There's always another chance!",
    "...",
    "Then you're suddenly halfway to thirty, and your Cinderella story has turned to ash.",
    "You're forced to bite life's poisoned apple and realize that you have nothing. You're nobody.",
    "You're all alone.",
    "All your friends have long since moved on, and the only girl who wants to talk to you is called Alexa.",
    "All those chances you thought you had — gone.",
    "You're stuck in a pool with no ladder, hoping you drown before...",
    "Before life hooks its marionette strings into your flesh once more, and you pray that one of them will catch your neck in a tight noose.",
    "...",
    "There my phone goes again, taunting me with a flicker of hope.",
    "Well... better check the latest promotional message from my dear mobile carrier...",
    { "action": "next", "name": "intro_phone_call" }
  ]
}